export default class Filter {
    constructor() {

    }

    getParams(){
        const staticParams = {
            kind: [
                "Открытого типа",
                "Закрытого типа",
                "Уличные лестницы"
            ],
            type: [
                "П-образная",
                "Г-образная",
                "Прямые",
                "Трехмаршевые",
                "Винтовая",
                "Модульная"
            ],
            carcas: [
                "На монокосоурах",
                "На косоурах",
                "На тетивах"
            ],
            stages: [
                "Из металла",
                "Из дерева"
            ],
            material: [
                "Из металла",
                "Из дерева",
                "Из стекла",
                "Троссовые"
            ]
        }

        this.params = staticParams;
    }

    getResults(){
        const staticResults = [
            {
                "id": 1,    
                "title": "Винтовая лестница 'Лиссабон'",
                "price": "По запросу",
                "kind": "Открытая",
                "type": "Винтовая",
                "carcas": "На монокосоуре",
                "stages": "Металл",
                "material": "Металлические",

            },
            {
                "id": 2,
          
                "title": "Винтовая лестница 'Авиньон'",
                "price": "По запросу",
                "kind": "Открытая",
                "type": "Винтовая",
                "carcas": "На монокосоуре",
                "stages": "Дерево",
                "material": "Металлические",

            },
            {
                "id": 3,
      
                "title": "Винтовая лестница 'Утрехт'",
                "price": "По запросу",
                "kind": "Открытая",
                "type": "Винтовая",
                "carcas": "На монокосоуре",
                "stages": "Дерево",
                "material": "Металлические",

            },
            {
                "id": 4,
                "title": "Винтовая лестница 'Осло'",
                "price": "По запросу",
                "kind": "Открытая",
                "type": "П-образная",
                "carcas": "На косоурах",
                "stages": "Дерево",
                "material": "Деревянные",

            },
            {
                "id": 5,
                "title": "Винтовая лестница 'Осло'",
                "price": "По запросу",
                "kind": "Закрытая",
                "type": "Винтовая",
                "carcas": "На монокосоуре",
                "stages": "Дерево",
                "material": "Металлические",

            },
            {
                "id": 6,
                "title": "Винтовая лестница 'Авиньон'",
                "price": "По запросу",
                "kind": "Уличная",
                "type": "Винтовая",
                "carcas": "На монокосоуре",
                "stages": "Дерево",
                "material": "Металлические",

            },
            {
                "id": 7,
                "title": "Винтовая лестница 'Авиньон'",
                "price": "По запросу",
                "kind": "Открытая",
                "type": "Винтовая",
                "carcas": "На монокосоуре",
                "stages": "Дерево",
                "material": "Металлические",

            },
            {
                "id": 8,
                "title": "Винтовая лестница 'Авиньон'",
                "price": "По запросу",
                "kind": "Открытая",
                "type": "Винтовая",
                "carcas": "На монокосоуре",
                "stages": "Дерево",
                "material": "Металлические",

            },
            {
                "id": 9,
                "title": "Винтовая лестница 'Авиньон'",
                "price": "По запросу",
                "kind": "Открытая",
                "type": "Винтовая",
                "carcas": "На монокосоуре",
                "stages": "Дерево",
                "material": "Металлические",

            },
            {
                "id": 10,
                "title": "Винтовая лестница 'Авиньон'",
                "price": "По запросу",
                "kind": "Открытая",
                "type": "Винтовая",
                "carcas": "На монокосоуре",
                "stages": "Дерево",
                "material": "Металлические",

            },
            {
                "id": 11,
                "title": "Винтовая лестница 'Авиньон'",
                "price": "По запросу",
                "kind": "Открытая",
                "type": "Винтовая",
                "carcas": "На монокосоуре",
                "stages": "Дерево",
                "material": "Металлические",

            },
            {
                "id": 12,
                "title": "Винтовая лестница 'Авиньон'",
                "price": "По запросу",
                "kind": "Открытая",
                "type": "Винтовая",
                "carcas": "На монокосоуре",
                "stages": "Дерево",
                "material": "Металлические",

            }   
        ]

        this.results = staticResults;
    }

}